# HasMarkersAndTextSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..HasMarkersAndTextSettings Method
AnalysisDisplayStyle Class See Also
---
If true style has markers and text settings.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool HasMarkersAndTextSettings()
```

Visual Basic
---
```text
Public Function HasMarkersAndTextSettings As Boolean
```

Visual C++
---
```text
public:
bool HasMarkersAndTextSettings()
```

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace